GuoZhiyong/RTT_GPS_STUSB_TEST/bsp/stm32f40x_production/drivers/printer.c
/************************************************************
 * Copyright (C), 2008-2012,
 * FileName:		// 文件名
 * Author:			// 作者
 * Date:			// 日期
 * Description:		// 模块描述
 * Version:			// 版本信息
 * Function List:	// 主要函数及其功能
 *     1. -------
 * History:			// 历史修改记录
 *     <author>  <time>   <version >   <desc>
 *     bitter    20121102     1.0     build this moudle
 ***********************************************************/

#include <stdio.h>
#include <rtthread.h>
#include <rtdevice.h>
#include "stm32f4xx.h"
#include "board.h"
#include "printer.h"
#include <finsh.h>

#include "sed1520.h"

/*打印头相关*/

//#define PAPER_DETCET_PORT	GPIOA
//#define PAPER_DETECT_PIN	GPIO_Pin_8

#define  CLK_PORT	GPIOE
#define  CLK_PIN	GPIO_Pin_0
#define  DI_PORT	GPIOB
#define  DI_PIN		GPIO_Pin_9

#define  LAT_PORT	GPIOC
#define  LAT_PIN	GPIO_Pin_13

#define  STB1_3_PORT	GPIOE
#define  STB1_3_PIN		GPIO_Pin_6

#define  STB4_6_PORT	GPIOE
#define  STB4_6_PIN		GPIO_Pin_4

#define  MTA_PORT	GPIOE
#define  MTA_PIN	GPIO_Pin_3

#define  MTAF_PORT	GPIOE
#define  MTAF_PIN	GPIO_Pin_5

#define  MTB_PORT	GPIOE
#define  MTB_PIN	GPIO_Pin_1

#define  MTBF_PORT	GPIOE
#define  MTBF_PIN	GPIO_Pin_2

//#define  NO_PAPER_OUT_PORT	GPIOB
//#define  NO_PAPER_OUT_PIN	GPIO_Pin_8

#define  PHE_PORT	GPIOD
#define  PHE_PIN	GPIO_Pin_8

//#define PRINTER_POWER_PORT_3V3	GPIOD
//#define PRINTER_POWER_PIN_3V3	GPIO_Pin_4

#define PRINTER_POWER_PORT_5V	GPIOB
#define PRINTER_POWER_PIN_5V	GPIO_Pin_7

#define MTA_H	( MTA_PORT->BSRRL = MTA_PIN )
#define MTA_L	( MTA_PORT->BSRRH = MTA_PIN )

#define MTAF_H	( MTAF_PORT->BSRRL = MTAF_PIN )
#define MTAF_L	( MTAF_PORT->BSRRH = MTAF_PIN )

#define MTB_H	( MTB_PORT->BSRRL = MTB_PIN )
#define MTB_L	( MTB_PORT->BSRRH = MTB_PIN )

#define MTBF_H	( MTBF_PORT->BSRRL = MTBF_PIN )
#define MTBF_L	( MTBF_PORT->BSRRH = MTBF_PIN )

/*收到的打印数据的编码包括换行符*/
#define PRINTER_DATA_SIZE 2048
unsigned char			printer_data[PRINTER_DATA_SIZE];
struct rt_ringbuffer	rb_printer_data;


uint8_t ctrlbit_printer_3v3_on=0;

/*
   要打印的图案 24x24dot 24*3=72byte
   384dot/line  384/8=48
   即 24行，每行384dot=48byte
   但是由于有左边界，右边界，所以并不是8bit或1byte对齐的方式
 */

#define GLYPH_ROW	24
#define GLYPH_COL	48

//static unsigned char print_glyph[GLYPH_ROW][GLYPH_COL] __attribute__( ( at( 0x20001000 ) ) ) = { 0 };
static unsigned char	print_glyph[GLYPH_ROW][GLYPH_COL] = { 0 };

static struct rt_device dev_printer;

struct _PRINTER_PARAM
{
	uint16_t	step_delay;                 //步进延时,影响行间隔
	uint16_t	gray_level;                 //灰度等级,加热时间
	uint32_t	heat_delay[4];              //加热延时
	uint16_t	line_space;                 //行间隔
	uint16_t	margin_left;                //左边界
	uint16_t	margin_right;               //右边界
} printer_param =
{
	//1000, 2, { 5000, 10000, 15000, 20000 }, 6, 0, 0  /*原来的168*us/7*/
	//16800,2,{84000,168000,252000,340000},6,0,0  /*新的10*us/7 真正的us*/
	//2,2,{8,16,25,35},6,0,0			/*折算到ticks*/
	1, 2, { 5, 10, 15, 20 }, 6, 0, 0        /*折算到ms*/
};

static unsigned short	dotremain = 384;    //还可使用的dot，每汉字24dot 每ascii 12dots
static unsigned char	print_str[36];      //要打印的单行最大字节数 全ascii 384/12=32  汉字 384/24*3
static unsigned char	print_str_len = 0;

/*要不要4字节对齐*/
static unsigned char font_glyph[80];        //每个汉字或ascii的最大字节数 24x24dot = 72bytes

//延时nus
//nus为要延时的us数.

void printer_delay_us( const uint32_t ticks )
{
	rt_thread_delay( ticks );
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void printer_delay_us1( const uint32_t usec )
{
	__IO uint32_t	count = 0;
	//const uint32_t	utime	= ( 168 * usec / 7 );
	const uint32_t	utime = ( 10 * usec / 7 );
	do
	{
		if( ++count > utime )
		{
			return;
		}
	}
	while( 1 );
}

/***********************************************************
* Function:       // 函数名称
* Description:    // 函数功能、性能等的描述
* Input:          // 1.输入参数1，说明，包括每个参数的作用、取值说明及参数间关系
* Input:          // 2.输入参数2，说明，包括每个参数的作用、取值说明及参数间关系
* Output:         // 1.输出参数1，说明
* Return:         // 函数返回值的说明
* Others:         // 其它说明
***********************************************************/
void printer_stop( void )
{
	MTA_L;
	MTAF_L;
	MTB_L;
	MTBF_L;
}

__IO uint8_t fprinting = 0;     //是否正在打印


/***********************************************************
* Function:       // 函数名称
* Description:    // 函数功能、性能等的描述
* Input:          // 1.输入参数1，说明，包括每个参数的作用、取值说明及参数间关系
* Input:          // 2.输入参数2，说明，包括每个参数的作用、取值说明及参数间关系
* Output:         // 1.输出参数1，说明
* Return:         // 函数返回值的说明
* Others:         // 其它说明
***********************************************************/
static void printer_port_init( void )
{
	GPIO_InitTypeDef gpio_init;

	RCC_AHB1PeriphClockCmd( RCC_AHB1Periph_GPIOB | RCC_AHB1Periph_GPIOC | RCC_AHB1Periph_GPIOD | RCC_AHB1Periph_GPIOE, ENABLE );
	/*去掉PB4 JTAG功能*/
	//GPIOB->AFR[0]|=(1<<16);
	GPIO_PinAFConfig( GPIOB, GPIO_Pin_4, 1 );

	gpio_init.GPIO_Mode		= GPIO_Mode_OUT;
	gpio_init.GPIO_OType	= GPIO_OType_PP;
	gpio_init.GPIO_Speed	= GPIO_Speed_50MHz;
	gpio_init.GPIO_PuPd		= GPIO_PuPd_NOPULL;

	gpio_init.GPIO_Pin = DI_PIN;
	GPIO_Init( DI_PORT, &gpio_init );
	GPIO_ResetBits( DI_PORT, DI_PIN );

	gpio_init.GPIO_Pin = CLK_PIN;
	GPIO_Init( CLK_PORT, &gpio_init );
	GPIO_ResetBits( CLK_PORT, CLK_PIN );

	gpio_init.GPIO_Pin = STB4_6_PIN;
	GPIO_Init( STB4_6_PORT, &gpio_init );
	GPIO_ResetBits( STB4_6_PORT, STB4_6_PIN );

	gpio_init.GPIO_Pin = STB1_3_PIN;
	GPIO_Init( STB1_3_PORT, &gpio_init );
	GPIO_ResetBits( STB1_3_PORT, STB1_3_PIN );

	gpio_init.GPIO_Pin = LAT_PIN;
	GPIO_Init( LAT_PORT, &gpio_init );
	GPIO_ResetBits( LAT_PORT, LAT_PIN );

	gpio_init.GPIO_Pin = MTA_PIN;
	GPIO_Init( MTA_PORT, &gpio_init );
	MTA_L;

	gpio_init.GPIO_Pin = MTAF_PIN;
	GPIO_Init( MTAF_PORT, &gpio_init );
	MTAF_L;

	gpio_init.GPIO_Pin = MTB_PIN;
	GPIO_Init( MTB_PORT, &gpio_init );
	MTB_L;

	gpio_init.GPIO_Pin = MTBF_PIN;
	GPIO_Init( MTBF_PORT, &gpio_init );
	MTBF_L;

	gpio_init.GPIO_Pin = PRINTER_POWER_PIN_5V;
	GPIO_Init( PRINTER_POWER_PORT_5V, &gpio_init );
	GPIO_ResetBits( PRINTER_POWER_PORT_5V, PRINTER_POWER_PIN_5V );

	//gpio_init.GPIO_Pin = PRINTER_POWER_PIN_3V3;
	//GPIO_Init( PRINTER_POWER_PORT_3V3, &gpio_init );
	//GPIO_SetBits( PRINTER_POWER_PORT_3V3, PRINTER_POWER_PIN_3V3 );
	ctrlbit_printer_3v3_on=0x20;

	gpio_init.GPIO_Pin	= PHE_PIN;
	gpio_init.GPIO_Mode = GPIO_Mode_IN;
	GPIO_Init( PHE_PORT, &gpio_init );
}

/***********************************************************
* Function:       // 函数名称
* Description:    // 函数功能、性能等的描述
* Input:          // 1.输入参数1，说明，包括每个参数的作用、取值说明及参数间关系
* Input:          // 2.输入参数2，说明，包括每个参数的作用、取值说明及参数间关系
* Output:         // 1.输出参数1，说明
* Return:         // 函数返回值的说明
* Others:         // 其它说明
***********************************************************/
void drivers1( void )
{
	MTA_H; MTAF_L; MTB_L; MTBF_H;
	printer_delay_us( printer_param.step_delay );
	MTA_L; MTAF_L; MTB_L; MTBF_H;
	printer_delay_us( printer_param.step_delay );
	MTA_L; MTAF_H; MTB_L; MTBF_H;
	printer_delay_us( printer_param.step_delay );
	MTA_L; MTAF_H; MTB_L; MTBF_L;
	printer_delay_us( printer_param.step_delay );
}

/***********************************************************
* Function:       // 函数名称
* Description:    // 函数功能、性能等的描述
* Input:          // 1.输入参数1，说明，包括每个参数的作用、取值说明及参数间关系
* Input:          // 2.输入参数2，说明，包括每个参数的作用、取值说明及参数间关系
* Output:         // 1.输出参数1，说明
* Return:         // 函数返回值的说明
* Others:         // 其它说明
***********************************************************/
void drivers2( void )
{
	MTA_L; MTAF_H; MTB_H; MTBF_L;
	printer_delay_us( printer_param.step_delay );
	MTA_L; MTAF_L; MTB_H; MTBF_L;
	printer_delay_us( printer_param.step_delay );
	MTA_H; MTAF_L; MTB_H; MTBF_L;
	printer_delay_us( printer_param.step_delay );
	MTA_H; MTAF_L; MTB_L; MTBF_L;
	printer_delay_us( printer_param.step_delay );
}

/***********************************************************
* Function:       // printer_load_param
* Description:    // 读取参数
* Input:          // 无
* Output:         // 无
* Return:         // 无
* Others:         // 其它说明
***********************************************************/
static void printer_load_param( void )
{
}

/***********************************************************
* Function:       // 函数名称
* Description:    // 函数功能、性能等的描述
* Input:          // 1.输入参数1，说明，包括每个参数的作用、取值说明及参数间关系
* Input:          // 2.输入参数2，说明，包括每个参数的作用、取值说明及参数间关系
* Output:         // 1.输出参数1，说明
* Return:         // 函数返回值的说明
* Others:         // 其它说明
***********************************************************/
static void printer_save_param( void )
{
}

