GuoZhiyong/RTT_GPS_STUSB_TEST/bsp/stm32f40x_production/drivers/printer.c
#define PRINTER_IDLE					1
#define PRINTER_GET_DATA_HEAT_1_3		2
#define PRINTER_STOP_HEAT_1_3_HEAT_4_6	3
#define PRINTER_STOP_HEAT_4_6			4
#define PRINTER_STEP_DOTROW1			5
#define PRINTER_STEP_DOTROW2			6
#define PRINTER_STEP_DOTROW3			7
#define PRINTER_STEP_DOTROW4			8
#define PRINTER_STEP_DOTROWEND			9

__IO uint32_t	timebase_1ms		= 0;
uint8_t			print_dotrow		= 0;    /*当前打印的点阵行*/
uint16_t		print_dotrow_end	= 30;   /*结束打印的行号*/
__IO uint8_t	print_stage			= PRINTER_IDLE;

/*1ms 定时中断*/
void TIM3_IRQHandler( void )
{
	unsigned char	*p;
	unsigned char	b, c, row, col_byte;

	if( TIM_GetITStatus( TIM3, TIM_IT_Update ) == RESET )
	{
		return;
	}
	TIM_ClearITPendingBit( TIM3, TIM_IT_Update );
	if( fprinting == 0 )
	{
		return;
	}
	/*缺纸检测 PA8 缺纸为高*/
	if( GPIO_ReadInputDataBit( PHE_PORT, PHE_PIN ) )
	{
		GPIO_ResetBits( PRINTER_POWER_PORT_5V, PRINTER_POWER_PIN_5V );
		fprinting=0;
		return;
	}
	timebase_1ms++;

	switch( print_stage )
	{
		case PRINTER_IDLE:
			GPIO_SetBits( PRINTER_POWER_PORT_5V, PRINTER_POWER_PIN_5V );
			print_stage = PRINTER_GET_DATA_HEAT_1_3;
			break;
		case PRINTER_GET_DATA_HEAT_1_3:
			p = print_glyph[print_dotrow];
			for( col_byte = 0; col_byte < GLYPH_COL; col_byte++ )
			{
				c = *p++;
				for( b = 0; b < 8; b++ )
				{
					GPIO_ResetBits( CLK_PORT, CLK_PIN );
					if( 0x80 == ( c & 0x80 ) )
					{
						GPIO_SetBits( DI_PORT, DI_PIN );
					}else
					{
						GPIO_ResetBits( DI_PORT, DI_PIN );
					}
					c <<= 1;
					GPIO_SetBits( CLK_PORT, CLK_PIN );
				}
			}
			GPIO_ResetBits( LAT_PORT, LAT_PIN );
			GPIO_SetBits( LAT_PORT, LAT_PIN );
			GPIO_SetBits( STB1_3_PORT, STB1_3_PIN );    /*加热*/
			print_stage		= PRINTER_STOP_HEAT_1_3_HEAT_4_6;
			timebase_1ms	= 0;                        /*启动定时*/
			break;
		case PRINTER_STOP_HEAT_1_3_HEAT_4_6:
			if( timebase_1ms < printer_param.heat_delay[printer_param.gray_level] )
			{
				break;
			}
			GPIO_ResetBits( STB1_3_PORT, STB1_3_PIN );
			GPIO_SetBits( STB4_6_PORT, STB4_6_PIN );
			print_stage		= PRINTER_STOP_HEAT_4_6;
			timebase_1ms	= 0;
			break;
		case PRINTER_STOP_HEAT_4_6:
			if( timebase_1ms < printer_param.heat_delay[printer_param.gray_level] )
			{
				break;
			}
			GPIO_ResetBits( STB4_6_PORT, STB4_6_PIN );
			print_stage = PRINTER_STEP_DOTROW1;
			break;
		case PRINTER_STEP_DOTROW1:
			GPIO_SetBits( PRINTER_POWER_PORT_5V, PRINTER_POWER_PIN_5V );
			if( print_dotrow & 0x01 ) //driver2
			{
				MTA_L; MTAF_H; MTB_H; MTBF_L;
			}else
			{
				MTA_H; MTAF_L; MTB_L; MTBF_H;
			}
			timebase_1ms	= 0;
			print_stage		= PRINTER_STEP_DOTROW2;
			break;
		case PRINTER_STEP_DOTROW2:
			if( timebase_1ms < printer_param.step_delay )
			{
				break;
			}
			if( print_dotrow & 0x01 ) //driver2
			{
				MTA_L; MTAF_L; MTB_H; MTBF_L;
			}else
			{
				MTA_L; MTAF_L; MTB_L; MTBF_H;
			}
			//rt_kprintf( "5" );
			timebase_1ms	= 0;
			print_stage		= PRINTER_STEP_DOTROW3;
			break;
		case PRINTER_STEP_DOTROW3:
			if( timebase_1ms < printer_param.step_delay )
			{
				break;
			}
			if( print_dotrow & 0x01 ) //driver2
			{
				MTA_H; MTAF_L; MTB_H; MTBF_L;
			}else
			{
				MTA_L; MTAF_H; MTB_L; MTBF_H;
			}
			timebase_1ms	= 0;
			print_stage		= PRINTER_STEP_DOTROW4;
			break;
		case PRINTER_STEP_DOTROW4:
			if( timebase_1ms < printer_param.step_delay )
			{
				break;
			}
			if( print_dotrow & 0x01 ) //driver2
			{
				MTA_H; MTAF_L; MTB_L; MTBF_L;
			}else
			{
				MTA_L; MTAF_H; MTB_L; MTBF_L;
			}
			timebase_1ms	= 0;
			print_stage		= PRINTER_STEP_DOTROWEND;
			break;
		case PRINTER_STEP_DOTROWEND:
			if( timebase_1ms < printer_param.step_delay )
			{
				break;
			}
			/*判断是点阵行的step还是行间距的步进*/
			print_dotrow++;
			if( print_dotrow < 24 )                     /*还在打印*/
			{
				print_stage = PRINTER_GET_DATA_HEAT_1_3;
			}else if( print_dotrow < print_dotrow_end ) /*打印行间距*/
			{
				print_stage = PRINTER_STEP_DOTROW1;
			}else
			{
				MTA_L; MTAF_L; MTB_L; MTBF_L;           /*停止*/
				GPIO_ResetBits( PRINTER_POWER_PORT_5V, PRINTER_POWER_PIN_5V );
				fprinting			= 0;
				print_stage			= PRINTER_IDLE;
				print_dotrow		= 0;
				print_dotrow_end	= 24 + printer_param.line_space;
			}
			break;
	}
}

/*定时器配置*/
void TIM_Config( void )
{
	NVIC_InitTypeDef		NVIC_InitStructure;
	TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure;

	/* TIM3 clock enable */
	RCC_APB1PeriphClockCmd( RCC_APB1Periph_TIM3, ENABLE );

	/* Enable the TIM3 gloabal Interrupt */
	NVIC_InitStructure.NVIC_IRQChannel						= TIM3_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority	= 0;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority			= 1;
	NVIC_InitStructure.NVIC_IRQChannelCmd					= ENABLE;
	NVIC_Init( &NVIC_InitStructure );

/* Time base configuration */
	TIM_TimeBaseStructure.TIM_Period		= 1000;             /* 1ms */
	TIM_TimeBaseStructure.TIM_Prescaler		= ( 168 / 2 - 1 );  /* 1M*/
	TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1;
	TIM_TimeBaseStructure.TIM_CounterMode	= TIM_CounterMode_Up;
	TIM_ARRPreloadConfig( TIM3, ENABLE );

	TIM_TimeBaseInit( TIM3, &TIM_TimeBaseStructure );

	TIM_ClearFlag( TIM3, TIM_FLAG_Update );
/* TIM Interrupts enable */
	TIM_ITConfig( TIM3, TIM_IT_Update, ENABLE );

/* TIM3 enable counter */
	TIM_Cmd( TIM3, ENABLE );
}

/*
   打印printer_data中的数据，一个可打印的字符行
   传入字符行的长度，是为了调整加热延时
 */
#if 0
void printer_print_glyph( void )
{
	unsigned char	*p;
	unsigned char	b, c, row, col_byte;
/*缺纸检测 PA8 缺纸为高*/
	if( GPIO_ReadInputDataBit( PHE_PORT, PHE_PIN ) )
	{
		rt_kprintf( "NO Paper\r\n" );
		GPIO_ResetBits( PRINTER_POWER_PORT_5V, PRINTER_POWER_PIN_5V );
		printer_stop( );
		return;
	}
	fprinting = 1;

	GPIO_SetBits( PRINTER_POWER_PORT_5V, PRINTER_POWER_PIN_5V );

	for( row = 0; row < 24; row++ )
	{
		p = print_glyph[row];
		for( col_byte = 0; col_byte < GLYPH_COL; col_byte++ )
		{
			c = *p++;
			for( b = 0; b < 8; b++ )
			{
				GPIO_ResetBits( CLK_PORT, CLK_PIN );

				if( 0x80 == ( c & 0x80 ) )
				{
					GPIO_SetBits( DI_PORT, DI_PIN );
				}else
				{
					GPIO_ResetBits( DI_PORT, DI_PIN );
				}
				c <<= 1;
				GPIO_SetBits( CLK_PORT, CLK_PIN );
			}
		}
		GPIO_ResetBits( LAT_PORT, LAT_PIN );
		GPIO_SetBits( LAT_PORT, LAT_PIN );

		GPIO_SetBits( STB1_3_PORT, STB1_3_PIN );
		printer_delay_us( printer_param.heat_delay[printer_param.gray_level] );
		GPIO_ResetBits( STB1_3_PORT, STB1_3_PIN );

		GPIO_SetBits( STB4_6_PORT, STB4_6_PIN );
		printer_delay_us( printer_param.heat_delay[printer_param.gray_level] );
		GPIO_ResetBits( STB4_6_PORT, STB4_6_PIN );

		if( row & 0x01 )
		{
			drivers2( );
		} else
		{
			drivers1( );
		}
	}

	for( col_byte = 0; col_byte < printer_param.line_space; col_byte++ )
	{
		drivers1( );
		drivers2( );
	}
	GPIO_ResetBits( PRINTER_POWER_PORT_5V, PRINTER_POWER_PIN_5V );
	printer_stop( );
	fprinting = 0;
}

#endif


