GuoZhiyong/RTT_GPS_STUSB_TEST/bsp/stm32f40x_production/drivers/printer.c
	rt_ringbuffer_init( &rb_printer_data, printer_data, PRINTER_DATA_SIZE );
	printer_load_param( );
	dotremain = 384 - printer_param.margin_left - printer_param.margin_right; //新的一行可打印字符点阵数
	printer_port_init( );
	printer_stop( );

	return RT_EOK;
}

/***********************************************************
* Function:
* Description:    在此是否应该给打印上电，只是在要打印时上电
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
static rt_err_t printer_open( rt_device_t dev, rt_uint16_t oflag )
{
	//GPIO_SetBits( PRINTER_POWER_PORT_3V3, PRINTER_POWER_PIN_3V3 );
	ctrlbit_printer_3v3_on=0x20;
	return RT_EOK;
}

/***********************************************************
* Function:       // 函数名称
* Description:    // 函数功能、性能等的描述
* Input:          // 1.输入参数1，说明，包括每个参数的作用、取值说明及参数间关系
* Input:          // 2.输入参数2，说明，包括每个参数的作用、取值说明及参数间关系
* Output:         // 1.输出参数1，说明
* Return:         // 函数返回值的说明
* Others:         // 其它说明
***********************************************************/
static rt_size_t printer_read( rt_device_t dev, rt_off_t pos, void* buff, rt_size_t count )
{
	return RT_EOK;
}

/***********************************************************
* Function:       // 函数名称
* Description:    // 函数功能、性能等的描述
* Input:          // 1.输入参数1，说明，包括每个参数的作用、取值说明及参数间关系
* Input:          // 2.输入参数2，说明，包括每个参数的作用、取值说明及参数间关系
* Output:         // 1.输出参数1，说明
* Return:         // 函数返回值的说明
* Others:         // 其它说明
***********************************************************/
static rt_size_t printer_write( rt_device_t dev, rt_off_t pos, const void* buff, rt_size_t count )
{
	rt_size_t ret = RT_EOK;
	ret = rt_ringbuffer_put( &rb_printer_data, (unsigned char*)buff, count );
	return ret;
}

/***********************************************************
* Function:       // 函数名称
* Description:    // 函数功能、性能等的描述
* Input:          // 1.输入参数1，说明，包括每个参数的作用、取值说明及参数间关系
* Input:          // 2.输入参数2，说明，包括每个参数的作用、取值说明及参数间关系
* Output:         // 1.输出参数1，说明
* Return:         // 函数返回值的说明
* Others:         // 其它说明
***********************************************************/
static rt_err_t printer_control( rt_device_t dev, rt_uint8_t cmd, void *arg )
{
	uint32_t	code = *(uint32_t*)arg;
	int			i;
	switch( cmd )
	{
		case PRINTER_CMD_CHRLINE_N:
			for( i = 0; i < code; i++ )
			{
				drivers1( );
				drivers2( );
				printer_stop( );
			}
			break;
		case PRINTER_CMD_DOTLINE_N:
			for( i = 0; i < code * 24; i++ )
			{
				drivers1( );
				drivers2( );
				printer_stop( );
			}
			break;
		case PRINTER_CMD_FACTORY:
			break;
		case PRINTER_CMD_GRAYLEVEL:
			printer_param.gray_level = code;
			break;
		case PRINTER_CMD_LINESPACE_DEFAULT:
			printer_param.line_space = code;
			break;
		case PRINTER_CMD_LINESPACE_N:
			if( code > 29 )
			{
				code = code % 29;
			} else
			{
				code = 4;
			}
			break;
		case PRINTER_CMD_MARGIN_LEFT:
			printer_param.margin_left = code;
			break;
		case PRINTER_CMD_MARGIN_RIGHT:
			printer_param.margin_right = code;
			break;
	}
	return RT_EOK;
}

/***********************************************************
* Function:
* Description:在此给打印机断电
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
static rt_err_t printer_close( rt_device_t dev )
{
	//GPIO_ResetBits( PRINTER_POWER_PORT_3V3, PRINTER_POWER_PIN_3V3 );
	ctrlbit_printer_3v3_on=0;
	GPIO_ResetBits( PRINTER_POWER_PORT_5V, PRINTER_POWER_PIN_5V );
	return RT_EOK;
}

ALIGN( RT_ALIGN_SIZE )
static char thread_printer_stack[512];
struct rt_thread thread_printer;


/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
static void rt_thread_entry_printer( void* parameter )
{
	TIM_Config( );
	while( 1 )
	{
		printer_get_str_line( );
		rt_thread_delay( RT_TICK_PER_SECOND / 10 );
	}
}

/***********************************************************
* Function:       // 函数名称
* Description:    // 函数功能、性能等的描述
* Input:          // 1.输入参数1，说明，包括每个参数的作用、取值说明及参数间关系
* Input:          // 2.输入参数2，说明，包括每个参数的作用、取值说明及参数间关系
* Output:         // 1.输出参数1，说明
* Return:         // 函数返回值的说明
* Others:         // 其它说明
***********************************************************/
void printer_driver_init( void )
{
	dev_printer.type		= RT_Device_Class_Char;
	dev_printer.init		= printer_init;
	dev_printer.open		= printer_open;
	dev_printer.close		= printer_close;
	dev_printer.read		= printer_read;
	dev_printer.write		= printer_write;
	dev_printer.control		= printer_control;
	dev_printer.user_data	= RT_NULL;

	rt_device_register( &dev_printer, "printer", RT_DEVICE_FLAG_WRONLY );
	rt_device_init( &dev_printer );

	rt_thread_init( &thread_printer,
	                "print",
	                rt_thread_entry_printer,
	                RT_NULL,
	                &thread_printer_stack[0],
	                sizeof( thread_printer_stack ), 6, 5 );
	rt_thread_startup( &thread_printer );
}

/***********************************************************
* Function:       printer_str
* Description:    输出生成的字符串
* Input:          const char *str
* Output:         字符串的glyph
* Return:         void
* Others:         无
***********************************************************/
void printer( const char *str )
{
	printer_write( &dev_printer, 0, str, strlen( str ) );
}

FINSH_FUNCTION_EXPORT( printer, print string test );

#if 0


/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void step2( const int count, const int delay )
{
	int i;

	if( GPIO_ReadInputDataBit( PHE_PORT, PHE_PIN ) )
	{
		rt_kprintf( "NO Paper\r\n" );
		return;
	}
	GPIO_SetBits( PRINTER_POWER_PORT_5V, PRINTER_POWER_PIN_5V );
	for( i = 0; i < count; i++ )
	{
		//drivers1();
		MTA_H; MTAF_L; MTB_L; MTBF_H;
		printer_delay_us( delay );
		MTA_L; MTAF_L; MTB_L; MTBF_H;
		printer_delay_us( delay );
		MTA_L; MTAF_H; MTB_L; MTBF_H;
		printer_delay_us( delay );
		MTA_L; MTAF_H; MTB_L; MTBF_L;
		printer_delay_us( delay );
		//drivers2();
		MTA_L; MTAF_H; MTB_H; MTBF_L;
		printer_delay_us( delay );
		MTA_L; MTAF_L; MTB_H; MTBF_L;
		printer_delay_us( delay );
		MTA_H; MTAF_L; MTB_H; MTBF_L;
		printer_delay_us( delay );
		MTA_H; MTAF_L; MTB_L; MTBF_L;
		printer_delay_us( delay );
		printer_stop( );
	}
	GPIO_ResetBits( PRINTER_POWER_PORT_5V, PRINTER_POWER_PIN_5V );
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void step1( const int count, const int delay )
{
	int i;

	if( GPIO_ReadInputDataBit( PHE_PORT, PHE_PIN ) )
	{
		rt_kprintf( "NO Paper\r\n" );
		return;
	}
	GPIO_SetBits( PRINTER_POWER_PORT_5V, PRINTER_POWER_PIN_5V );
	for( i = 0; i < count; i++ )
	{
		drivers2( );
		drivers1( );
		printer_stop( );
	}

	GPIO_ResetBits( PRINTER_POWER_PORT_5V, PRINTER_POWER_PIN_5V );
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void step( const int count, const int delay )
{
	print_dotrow		= 24;
	print_dotrow_end	= 24 + count;
	print_stage			= PRINTER_STEP_DOTROW1;
	fprinting			= 1;
}

FINSH_FUNCTION_EXPORT( step, print step test );
#endif

/************************************** The End Of File **************************************/
